[
  {
    "name": "Achieving sub-second IGP convergence in large IP networks",
    "author": [
      "PFR"
    ],
    "abstract": "We describe and analyse in details the various factors that influence the convergence time of intradomain link state routing protocols. This convergence time reflects the time required by a network to react to the failure of a link or a router. To characterise the convergence process, we first use detailed measurements to determine the time required to perform the various operations of a link state protocol on currently deployed routers. We then build a simulation model based on those measurements and use it to study the convergence time in large networks. Our measurements and simulations indicate that sub-second link-state IGP convergence can be easily met on an ISP network without any compromise on stability"
  },
  {
    "name": "Avoiding transient loops during the convergence of link-state routing protocols",
    "author": [
      "PFR"
    ],
    "abstract": "When using link-state protocols such as OSPF or IS-IS, forwarding loops can occur transiently when the routers adapt their forwarding tables as a response to a topological change. In this paper, we present a mechanism that lets the network converge to its optimal forwarding state without risking any transient loops and the related packet loss. The mechanism is based on an ordering of the updates of the forwarding tables of the routers. Our solution can be used in the case of a planned change in the state of a set of links and in the case of unpredictable changes when combined with a local protection scheme. The supported topology changes are link transitions from up to down, down to up, and updates of link metrics. Finally, we show by simulations that sub-second loop-free convergence is possible on a large Tier-1 ISP network."
  },
  {
    "name": "Disruption free topology reconfiguration in OSPF networks",
    "author": [
      "PFR"
    ],
    "abstract": "A few modifications to software and/or hardware of routers have been proposed recently to avoid the transient micro loops that can occur during the convergence of link-state interior gateway protocols like IS-IS and OSPF. We propose in this paper a technique that does not require modifications to ISIS and OSPF, and that can be applied now by ISPs. Roughly, in the case of a manual modification of the state of a link, we progressively change the metric associated with this link to reach the required modification by ensuring that each step of the progression will be loop-free. The number of changes that are applied to a link to reach the targeted state by ensuring the transient consistency of the forwarding inside the network is minimized. Analysis performed on real regional and tier-1 ISP topologies show that the number of required transient changes is small. The solution can be applied in the case of link metric …"
  },
   {
    "name": "An evaluation of IP-based fast reroute techniques",
    "author": [
      "PFR"
    ],
    "abstract": "Today, IP-based networks are used to carry all types of traffic, from the traditional best-effort Internet access to traffic with much more stringent requirements such as realtime voice or video services and Virtual Private Networks. Some of those services have strong requirements in terms of restoration time in case of failure. When a link or a router fails in an IP network, the routers adjacent to the failing ressource must react by distributing new routing information to allow each router of the network to update its routing table. A realistic estimate of the convergence time of a tuned intradomain routing protocol in a large network is a few hundred of milliseconds [1]. For some mission critical services like voice or video over IP, achieving a restoration time in the order of a few tens of milliseconds after a failure is important [2]. In this paper, we first present several techniques that can be used to achieve such a short restoration …"
  },
   {
    "name": "Avoiding disruptions during maintenance operations on BGP sessions",
    "author": [
      "PFR"
    ],
    "abstract": "This paper presents a solution aimed at avoiding losses of connectivity when an eBGP peering link is shut down by an operator for a maintenance. Currently, shutting down an eBGP session can lead to transient losses of connectivity even though alternate path are available at the borders of the network. This is very unfortunate as ISPs face more and more stringent service level agreements, and maintenance operations are predictable operations, so that there is time to adapt to the change and preserve the respect of the service level agreement."
  },
   {
    "name": "Is RSSI a good choice for localization in wireless sensor network?",
    "author": [
      "FVA"
    ],
    "abstract": "Numerous localization protocols in Wireless Sensor Networks are based on Received Signal Strength Indicator. Because absolute positioning is not always available, localization based on RSSI is popular. More, no extra hardware is needed unlike solutions based on infra-red or ultrasonic. Moreover, the theory gives a RSSI as a function of distance. However, using RSSI as a distance metric involves errors in the measured values, resulting path-loss, fading, and shadowing effects. We present experimentation results from three large WSNs, each with up to 250 nodes. Based on our findings from the 3 systems, the relation between RSSI and distance is investigated according to the topology properties and the radio environment. We underline the intrinsic limitations of RSSI as a distance metric, in terms of accuracy and stability. Contrary to what we assumed, collaborative localization protocol based on Spring …"
  },
   {
    "name": "A self-organization structure for hybrid networks",
    "author": [
      "FVA"
    ],
    "abstract": "This paper focuses on the self-organization of ad hoc and hybrid networks. We propose to organize networks with two integrated virtual structures: a backbone and clusters. The backbone helps to optimize the flooding of control packets, and to offer a natural prolongation of the backbone of wired networks. Clusters help to hierarchize the network, each of which is managed logically by its clusterhead. Since MANETs are mobile, we propose distributed algorithms for both the construction and the maintenance to preserve an efficient virtual structure despite topology changes. Simulations results exhibit the robustness and persistence of the proposed virtual structure."
  },
   {
    "name": "QoS-oriented channel assignment strategy for hierarchical cellular networks",
    "author": [
      "FVA"
    ],
    "abstract": "In the third generation of wireless cellular communication systems, cell sizes are expected to become smaller in order to accommodate high user density and multimedia traffic. In such a system, where hierarchical cellular networks are used, microcells may coexist with macrocells. Resource allocation schemes will have to be dynamic and flexible to handle user mobility and traffic variation. In this paper, we propose a new allocation strategy to manage both fast and slow users resources request in such a network. Our contribution uses an enhanced mechanism based on preemption which can be viewed as a reversible strategy on-demand using channel re-allocation. The originality of this work is to take into account the current value of QoS criteria provided to mobile users to perform resource allocation. Our new scheme is simulated and performance is analyzed in terms of new call blocking and dropping handover …"
  },
   {
    "name": "Optimized data aggregation in wsns using adaptive arma",
    "author": [
      "FVA"
    ],
    "abstract": "Wireless sensor networks (WSNs) are data centric networks to which data aggregation is a central mechanism. Nodes in such networks are known to be of low complexity and highly constrained in energy. This requires novel distributed algorithms to data aggregation, where accuracy, complexity and energy need to be optimized in the aggregation of the raw data as well as the communication process of the aggregated data. To this end, we propose in this work a distributed data aggregation scheme based on an adaptive Auto-Regression Moving Average (ARMA) model estimation using a moving window technique and running over suitable communications protocols. In our approach, we balance the complexity of the algorithm and the accuracy of the model so as to facilitate the implementation. Subsequent analysis shows that an aggregation efficiency of up to 60% can be achieved with a very fine accuracy of 0 …"
  },
   {
    "name": "Overview of LTE isolated E-UTRAN operation for public safety",
    "author": [
      "FVA",
      "RST"
    ],
    "abstract": "In response to the growing demand in the public safety community for broadband communication systems, LTE is currently being adopted as the base technology for next generation public safety networks. In parallel, notable efforts are being made by the 3GPP to enhance the LTE standard in order to offer public safety oriented services. In the recent Release 13, the Isolated E-UTRAN Operation for Public Safety (IOPS) concept was introduced. IOPS aims at maintaining a level of communication between public safety users, offering them local mission-critical services even when the backhaul connectivity to the core network is not fully functional. Isolated operation is usually needed in mission-critical situations, when the infrastructure is damaged or completely destroyed, and in out of coverage areas. In this article, we present a detailed technical overview of the IOPS specifications, and then identify several research …"
  },
   {
    "name": "WARIM: Wireless sensor networks architecture for a reliable intersection monitoring",
    "author": [
      "FVA",
      "RST"
    ],
    "abstract": "A traffic light controller takes as input an estimation of the number of vehicles entering the intersection and produces as output a light plan, with the objective to reduce the traffic jam. The quality of the input traffic estimation is a key consideration on the performance of the traffic light controller. The advent of Wireless Sensor Networks, with their relatively low deployment and operation price, led to the development of several sensor-based architectures for intersection monitoring. We show in this paper that the solutions proposed in the literature are unrealistic in terms of communication possibilities and that they do not allow a measure of the vehicular queue length at a lane level. Based on extensive experimental results, we propose an energy efficient, low cost and lightweight multihop wireless sensor network architecture to measure with a good accuracy the vehicle queue length, in order to have a more precise …"
  },
   {
    "name": "Sensor deployment in wireless sensor networks with linear topology using virtual node concept",
    "author": [
      "FVA",
      "RST"
    ],
    "abstract": "In a multi-hop wireless sensor network with a convergecast communication model, there is a high traffic accumulation in the neighborhood of the sink. This area constitutes the bottleneck of the network since the sensors deployed withing it rapidly exhaust their batteries. In this paper, we consider the problem of sensors deployment for lifetime maximization in a linear wireless sensor network. Existing approaches express the deployment recommendations in terms of distance between consecutive sensors. Solutions imposing such constraints on the deployment may be costly and difficult to manage. In this paper, we propose a new approach where the network is formed of virtual nodes, each associated to a certain geographical area. An analytical model of the network traffic per virtual node is proposed and a greedy algorithm to calculate the number of sensors that should form each virtual node is presented …"
  },
   {
    "name": "Space-terrestrial integrated Internet of Things: Challenges and opportunities",
    "author": [
      "FVA",
      "OIO"
    ],
    "abstract": "Large geographical regions of our planet remain uncovered by terrestrial network connections. Sparse and dense constellations of near Earth orbit satellites can bridge this gap by providing Internet of Things (IoT) connectivity on a worldwide scale in a flexible and cost-effective manner. This article presents STEREO: a novel space-terrestrial integrated IoT architecture spanning direct- and indirect-to-satellite access from IoT assets on the surface. Framed on the identified requirements, we analyze NB-IoT and LoRa/LoRaWAN features to put these technologies forward as appealing candidates for future satellite IoT deployments. Finally, we list and discuss the key open research challenges to be addressed in order to achieve successful space-terrestrial IoT integration."
  },
   {
    "name": "Uplink and downlink are not orthogonal in LoRaWAN!",
    "author": [
      "FVA",
      "OIO"
    ],
    "abstract": "LoRaWAN is a major player for IoT data collection in large areas. In such networks, the uplink is mainly used, especially for data transmission, whereas the downlink is used for control purposes, including physical layer configuration, over the air activation and acknowledgments. In most studies of the LoRaWAN capacity, the uplink and the downlink are supposed to be orthogonal. This assumption seems acceptable and correct because the LoRa physical layer uses an inverse modulation for the uplink and the downlink. In this work, we use a real testbed composed of software-defined radio (USRPs, GNU Radio) to show that this assumption is wrong: the frame delivery rate decreases by up to 20% when simultaneous transmissions occur between the uplink and the downlink. As far as we know, it is the first time that this result is shown."
  },
   {
    "name": "Multiservice home gateways: Business model, execution environment, management infrastructure",
    "author": [
      "SFR"
    ],
    "abstract": "The home gateway market is undergoing deep changes. On one side, home networks are evolving, getting dynamic and federating more and more devices. On the WAN side, new actors appear, such as multimedia content providers. From both sides emerge new features and new management needs. In this article we highlight challenges and benefits of moving more intelligence to the home gateway, making it more than a simple interconnection device. We argue that we need a full-fledged execution environment on gateways to address the evolution of business models. We present this evolution and summarize existing solutions for execution environments and management for home gateways. Then we propose two improvements that reflect the new requirements. The first improvement is a high-level virtualization of service gateways, and the second one recommends an end-to-end dynamic multiprovider …"
  },
   {
    "name": "Security benchmarks of OSGi platforms: toward hardened OSGi",
    "author": [
      "SFR"
    ],
    "abstract": "OSGi platforms are extensible component platforms, i.e. they support the dynamic and transparent installation of components that are provided by third party providers at runtime. This feature makes systems built using OSGi extensible and adaptable, but opens a dangerous attack vector that has not been considered as such until recently. Performing a security benchmark of the OSGi platform is therefore necessary to gather knowledge related to the weaknesses it introduces as well as to propose enhancements. A suitable Vulnerability Pattern is defined. The attacks that can be performed through malicious OSGi components are identified. Quantitative analysis is then performed so as to characterize the origin of the vulnerabilities and the target and consequences of the attacks. The assessment of the security status of the various implementations of the OSGi platform and of existing security mechanisms is done …"
  },
   {
    "name": "Classification of component vulnerabilities in java service oriented programming (sop) platforms",
    "author": [
      "SFR"
    ],
    "abstract": "Java-based systems have evolved from stand-alone applications to multi-component to Service Oriented Programming (SOP) platforms. Each step of this evolution makes a set of Java vulnerabilities directly exploitable by malicious code: access to classes in multi-component platforms, and access to object in SOP, is granted to them with often no control.This paper defines two taxonomies that characterize vulnerabilities in Java components: the vulnerability categories, and the goals of the attacks that are based on these vulnerabilities. The ‘vulnerability category’ taxonomy is based on three application types: stand-alone, class sharing, and SOP. Entries express the absence of proper security features at places they are required to build secure component-based systems. The ‘goal’ taxonomy is based on the distinction between undue access, which encompasses the traditional integrity and …"
  },
   {
    "name": "Component-based access control: Secure software composition through static analysis",
    "author": [
      "SFR"
    ],
    "abstract": "Extensible Component Platforms support the discovery, installation, starting, uninstallation of components at runtime. Since they are often targeted at mobile resource-constrained devices, they have both strong performance and security requirements. The current security model for Java systems – Permissions – is based on call stack analysis. This is very time-consuming, which makes it difficult to use in production environments.We therefore define the Component-Based Access Control (CBAC) Security Model, which emulates Java Permissions through static analysis at the installation phase of the components. CBAC is based on a fully declarative approach that makes it possible to tag arbitrary methods as sensitive. A formal model is defined to guarantee that a given component have sufficient access rights, and that dependencies between components are taken into account."
  },
   {
    "name": "I-JVM: a Java virtual machine for component isolation in OSGi",
    "author": [
      "SFR"
    ],
    "abstract": "The OSGi framework is a Java-based, centralized, component oriented platform. It is being widely adopted as an execution environment for the development of extensible applications. However, current Java Virtual Machines are unable to isolate components from each other. For instance, a malicious component can freeze the complete platform by allocating too much memory or alter the behavior of other components by modifying shared variables. This paper presents I-JVM, a Java Virtual Machine that provides a lightweight approach to isolation while preserving compatibility with legacy OSGi applications. Our evaluation of I-JVM shows that it solves the 8 known OSGi vulnerabilities that are due to the Java Virtual Machine and that the overhead of I-JVM compared to the JVM on which it is based is below 20%."
  },
   {
    "name": "Virtualization of service gateways in multi-provider environments",
    "author": [
      "SFR",
      "FLM"
    ],
    "abstract": "Today we see more and more services, such as entertainment or home automation, being brought to connected homes. These services are published and operated by a variety of service providers. Currently, each provider sells his own box, providing both connectivity and a closed service environment. The open service paradigm aims at mixing all services within the same box, thus opening the service delivery chain for home users. However, open service gateways still lack important mechanisms. Multiple service providers can access and use the same gateway concurrently. We must define what this use is, i.e. we must define a notion of user. Also, service providers should not interfere with each other on the gateway, except if explicitly required. In other words, we must isolate services from different providers, while still permitting on-demand collaboration. By combining all these mechanisms, we are …"
  },
   {
    "name": "Mysim: a spontaneous service integration middleware for pervasive environments",
    "author": [
      "SFR",
      "FLM"
    ],
    "abstract": "A computing infrastructure where everything is a service offers many new system and application possibilities. Among the main challenges, however, is the issue of service integration for the application development in such heterogeneous environments. Service integration has been considered by major middleware as a user centric approach as it responds to user requests and needs. In this article, we propose a novel way to integrate services considering only their availability, the functionalities they propose and their non functional QoS properties rather than the users direct requests. We define MySIM, a spontaneous service integration middleware. MySIM integrates services spontaneously on an event based mechanism and transparently for users and applications, extending by that the environment with functionalities. We developed a prototype as a proof of concept and evaluated its efficiency over a real use …"
  },
   {
    "name": "Towards bridging IOT and cloud services: proposing smartphones as mobile and autonomic service gateways",
    "author": [
      "SFR",
      "FLM"
    ],
    "abstract": "Today we see more and more services, such as entertainment or home automation, being brought to connected homes. These services are published and operated by a variety of service providers. Currently, each provider sells his own box, providing both connectivity and a closed service environment. The open service paradigm aims at mixing all services within the same box, thus opening the service delivery chain for home users. However, open service gateways still lack important mechanisms. Multiple service providers can access and use the same gateway concurrently. We must define what this use is, i.e. we must define a notion of user. Also, service providers should not interfere with each other on the gateway, except if explicitly required. In other words, we must isolate services from different providers, while still permitting on-demand collaboration. By combining all these mechanisms, we are …"
  },
     {
    "name": "Modeling self satisfaction and altruism to handle action selection and reactive cooperation",
    "author": ["OSI"],
    "abstract": "This paper proposes a method for integrating cooperative behaviors among distributed autonomous agents based on local communications. We define agent satisfaction as a signal to handle action selection and cooperative interaction. The resolution of spatial problems is handled with an altruistic behavior defined with the vector field model. This solution ensure the spatial coordination of multiple agents in a dynamic system and the selection of an altruistic behavior when necessary. After presenting the agent architecture we describe experimental results. They illustrate the ability of the model to achieve efficient navigation, adaptive and reactive cooperation in collective robotics application."
  },
     {
    "name": "Simulation and evaluation of urban bus-networks using a multiagent approach",
    "author": ["OSI"],
    "abstract": "Evolution of public road transportation systems requires analysis and planning tools to improve service quality. A wide range of road transportation simulation tools exist with a variety of applications in planning, training and demonstration. However, few simulation models take into account traveler behaviors and vehicle operation specific to public transportation. We present in this paper a bus-network simulation tools which include these specificities and allows to analyze and evaluate a bus-network at diverse space and time scales. We adopt a multiagent approach to describe the global system operation as behaviors of numerous autonomous entities such as buses and travelers."
  },
     {
    "name": "MinPos : A Novel Frontier Allocation Algorithm for Multi-robot Exploration",
    "author": ["OSI"],
    "abstract": "Exploring an unknown environment with multiple robots requires an efficient coordination method to minimize the total duration. A standard method to discover new areas is to assign frontiers (boundaries between unexplored and explored accessible areas) to robots. In this context, the frontier allocation method is paramount. This paper introduces a decentralized and computationally efficient frontier allocation method favoring a well balanced spatial distribution of robots in the environment. For this purpose, each robot evaluates its relative rank among the other robots in term of travel distance to each frontier. Accordingly, robots are allocated to the frontier for which it has the lowest rank. To evaluate this criteria, a wavefront propagation is computed from each frontier giving an interesting alternative to path planning from robot to frontiers. Comparisons with existing approaches in computerized simulation and …"
  },
     {
    "name": "Swarm approaches for the patrolling problem, information propagation vs. pheromone evaporation",
    "author": ["OSI"],
    "abstract": "This paper deals with the multi-agent patrolling problem in unknown environment using two collective approaches exploiting environmental dynamics. After specifying criteria of performances, we define a first algorithm based only on the evaporation of a pheromone dropped by reactive agents (EVAP). Then we present the model CLInG [10] proposed in 2003 which introduces the diffusion of the idleness of areas to visit. We systematically compare by simulations the performances of these two models on growing- complexity environments. The analysis is supplemented by a comparison with the theoretical optimum performances, allowing to identify topologies for which methods are the most adapted."
  },
     {
    "name": "Safe longitudinal platoons of vehicles without communication",
    "author": ["OSI"],
    "abstract": "This paper deals with the platooning problem that can be defined as the automatic following of a manned driven vehicle by a convoy of automatic ones. Different approaches have been proposed so far. Some require the localisation of each vehicle and a communication infrastructure, others called near-to-near approach only needs vehicle on-board sensors. However, to our knowledge, they do not provide any proof of non collision. We propose a novel near-to-near longitudinal platooning building a collision-free platooning whatever the number of vehicles. The model is derived from the study of the most dangerous interaction between two vehicles, i.e. considering the maximum acceptable acceleration when the previous vehicles brakes at maximum capacity. Collision avoidance of this model is proved. Finally, we show that this model can be combined to existing ones, keeping this collision-free property while …"
  },
     {
    "name": "Dedicated networks for IoT: PHY/MAC state of the art and challenges",
    "author": ["CGO"],
    "abstract": "This paper focuses on the the emerging transmission technologies dedicated to IoT networks. We first analyze the classical cellular network technologies when taking into account the IoT requirements, and point out the need of dedicated technologies for IoT. Then, we present the PHY and MAC layers of the technologies that are already deployed, or likely to be deployed: UNB by SigFox, CSS by LoRa T M , Weighless, and RPMA by Ingenu. We then compare their performances to highlight their pros and cons. Finally, we discuss on the open research challenges that still need to be addressed."
  },
     {
    "name": "Cooperative scheduling for coexisting body area networks",
    "author": ["CGO"],
    "abstract": "Body area networks (BANs), referring to embedded wireless systems in, on, and around bodies, are expected to take an important role for health, leisure, sports, and all the facets of our daily life. In many cases, several BANs coexist in a small area, resulting in very strong inter-BAN interference, which seriously disturbs intra-BAN communications. The goal of this paper is to decrease inter-BAN interference by cooperative scheduling, hence increasing packet reception rate (PRR) of intra-BAN communications. Cooperative scheduling here is divided into two sub-problems: single-BAN scheduling as an assignment problem and multi-BAN concurrent scheduling as a game. For the first sub-problem, a low complexity algorithm, horse racing scheduling, is proposed, which achieves near-optimal PRR for the BAN performing scheduling. For the second sub-problem, we prove the existence of a set of mixed strategy Nash …"
  },
     {
    "name": "Random unslotted time-frequency ALOHA: Theory and application to IoT UNB networks",
    "author": ["CGO"],
    "abstract": "The ALOHA protocol is regaining interest in the context of the Internet of Things (IoT), especially for Ultra Narrow Band (UNB) signals. In this case, the classical assumption of channelization is not verified anymore, modifying the ALOHA performances. Indeed, UNB signals suffer from a lack of precision on the actual transmission carrier frequency, leading to a behavior similar to a frequency unslotted random access. In this paper, the success probability and throughput of ALOHA is generalized to further describe frequency-unslotted systems such as UNB. The main contribution of this paper is the derivation of a generalized expression of the throughput for the random time-frequency ALOHA systems. Besides, this study permits to highlight the duality of ALOHA in time and frequency domain."
  },
     {
    "name": "Parallel multiple access interference cancellation in optical DS-CDMA systems",
    "author": ["CGO"],
    "abstract": "This paper investigates the Parallel Interference Cancellation technique in Direct Sequence Optical Code Division Multiple Access (DS-OCDMA) system. In the proposed system, the estimated interference is removed from the received signal. We have developped a new approach to obtain the analytical expression of error probability in chip synchronous case, for Optical Orthogonal Codes (OOC). We have shown that under specific conditions between codes parameters and users’ number, the interference can be completely neutralized. Simulation results have validated the theoretical analysis. It is shown that the proposed receiver is effective in reducing significantly the effects of Multiple Access Interference (MAI) compared to other interference cancellation systems."
  },
     {
    "name": "DS-OCDMA receivers based on parallel interference cancellation and hard limiters",
    "author": ["CGO"],
    "abstract": "In an incoherent direct-sequence optical code-division multiple-access (DS-OCDMA) system, multiple-access interference (MAI) is one of the principal limitations. To mitigate MAI, the parallel interference cancellation (PIC) technique can be used to remove nondesired users' contribution. In this paper, we study four DS-OCDMA receivers based on the PIC technique with hard limiters placed before the nondesired users or before the desired user receiver, or both. We develop, for the ideal synchronous case, the theoretical upper bound of the error probability for the four receivers. Significant performance improvement is obtained by comparison with conventional receivers in the case of optical orthogonal codes. The paper highlights that the number of active users with null error probability is doubled, compared with conventional receivers. Finally, we show that, thanks to their good performances, the PIC structures …"
  },
     {
    "name": "Prime code efficiency in DS–OCDMA systems using parallel interference cancellation",
    "author": ["CGO"],
    "abstract": "In this paper, we are studying the Prime Codes (PC) efficiency, in Direct Sequence Optical Code Division Multiple Access system (DS-OCDMA) using Parallel Interference Cancellation receiver (PIC). We develop the analytical expression of the error probability upper bound in the chip synchronous case, for PC. The main result of our work is that the PIC receiver totally suppresses the effect of Multiple Access Interference (MAI) for Prime Codes, and leads to an error free O-CDMA link in the noiseless case, for whichever employed PC. Simulation results are presented to validate the theoretical analysis. We also show that the PIC receiver permits reducing the required code length for a given Bit Error Rate compared to the Conventional Correlation Receiver. Finally, we compare the PC to the Optical Orthogonal Codes (OOC), and show that the use of PC allows a significant reduction of the required SNR."
  },
     {
    "name": "A new minimum variance region growing algorithm for image segmentation",
    "author": ["CMU"],
    "abstract": ""
  },
     {
    "name": "Automated 3D region growing algorithm based on an assessment function",
    "author": ["CMU"],
    "abstract": "A new region growing algorithm is proposed for the automated segmentation of three-dimensional images. No initial parameters such as the homogeneity threshold or the seeds location have to be adjusted. The principle of our method is to build a region growing sequence by increasing the maximal homogeneity threshold from a very small value to a large one. On each segmented region, a 3D parameter that has been validated on a test image assesses the segmentation quality. This set of values called assessment function is used to determine of the optimal homogeneity criterion. Our algorithm was tested on 3D MR images for the segmentation of trabecular bone samples in order to quantify osteoporosis. A comparison to automated and manual thresholding showed that our algorithm performs better. Its main advantages are to eliminate isolated points due to the noise and to preserve connectivity of the bone …"
  },
     {
    "name": "Hybrid approach for multiparametric mean shift filtering",
    "author": ["CMU"],
    "abstract": "In ultrasound imaging, robustness of the diagnosis can be improved by using many images of parameters. In this paper we propose a hybrid approach for improving multi-parametric mean shift filtering (MPMS). Multi-parametric filtering is really attractive since it works conjointly in the spatial-range domain, taking into account the spatial location of the data as well as the range values of many parameters. Hybrid MPMS is an. iterative method that combines two mean shift procedures called nonblurring and blurring. Our method was positively tested on a set of simulated ultrasound data. The results show the superiority of hybrid MPMS compared to the simple MPMS filtering."
  },
     {
    "name": "3D robust adaptive region growing for segmenting [18F] fluoride ion PET images",
    "author": ["CMU"],
    "abstract": "We propose a new robust adaptive region growing method (RoAd RG) based on two local parameters: the local mean value of the intensity function and the local mean value of the norm of the intensity gradient. This approach enables a better spread of the region growing inside the region of interest while avoiding the merge of outlier pixels. We tested our method on a synthesized noisy image, and demonstrated that RoAd RG gives better result than non adaptive or not fully adaptive methods. We applied positively our method to 3D [18F]fluoride ion PET images for segmenting bone structures, and showed its superiority compared to a non adaptive method."
  },
     {
    "name": "Dempster shafer approach for high level data fusion applied to the assessment of myocardial viability",
    "author": ["CMU"],
    "abstract": "A modular data fusion system based on the Dempster-Shafer framework is presented. This system allows the building of any architecture off usion by chaining elementary modules. Two types ofmo dules are used, the numerical to symbolic conversion modules and the combination modules using logical rules ofcom bination. The uncertainty is modeled by a basic belief assignment or the plausibility of each hypothesis. We applied our system to assess the Left Ventricular (LV) myocardial viability. The parameters taken into account are the LV contractile function extracted from tagged Magnetic Resonance Images (MRI) and the glucose metabolism rate obtained by Positron Emission Tomography (PET) imaging. The variables ofin terest are defined by the medical experts. The results are displayed on polar maps to give a geometrical information of the potential lesions."
  },
     {
    "name": "Construction of do loops from systems of affine constraints",
    "author": ["TRI"],
    "abstract": "Most parallelization techniques for DO loop nests are based on reindexation. Reindexation yields a new iteration space, which is a convex integer polyhedron defined by a set of affine constraints. Parallel code generation thus needs to scan all the integer points of this convex, thereby requiring the construction of a new  loop nest. We detail an algorithm to this purpose, which relies on a parametrized version of the Dual Simplex. We show how the resulting loop nest and especially the loop bounds can be kept simple, thus reducing the control overhead of parallelization to a minimum."
  },
     {
    "name": "UWB ranging for rapid movements",
    "author": ["TRI"],
    "abstract": "Ultra Wide Band (UWB) provides ranging capabilities much more precise than other radio communication technologies. This paper presents experimental measurement of ranging precision between two UWB tags when one of the tag is moving fast. The use of a specific electro-pneumatic actuator provides precise ground truth for real distance. This study will allow to improve ranging for human wearable tags as for example sportsmen positioning or interaction between dancers during live performances. We show in particular how the inherent noisy measurement has to be smoothed to obtain more accurate ranging."
  },
     {
    "name": "Interfacing compiled FPGA programs: the MMAlpha approach",
    "author": ["TRI"],
    "abstract": "The compilation process for a fpga co-processor must produce a vhdl program which is processed by vendors' tools to be downloaded on the fpga board. To be complete, the design must be interfaced to the host computer. We describe techniques to generate e cient interfaces for the type of vhdl programs generated by the MMAlpha tool: one dimensional systolic arrays. More precisely, we show how to conceive a parameterized interface which will be generic and automatically generated for a given systolic design. We also provide some experimental results of the implementation of such interface on a co-processor board."
  },
     {
    "name": "A survey on service composition middleware in pervasive environments",
    "author": ["FLM"],
    "abstract": "The development of pervasive computing has put the light on a challenging problem: how to dynamically compose services in heterogeneous and highly changing environments? We propose a survey that defines the service composition as a sequence of four steps: the translation, the generation, the evaluation, and finally the execution. With this powerful and simple model we describe the major service composition middleware. Then, a classification of these service composition middleware according to pervasive requirements - interoperability, discoverability, adaptability, context awareness, QoS management, security, spontaneous management, and autonomous management - is given. The classification highlights what has been done and what remains to do to develop the service composition in pervasive environments."
  },
     {
    "name": "MySIM: a spontaneous service integration middleware for pervasive environments",
    "author": ["FLM"],
    "abstract": "A computing infrastructure 'where everything is a service' offers many new system and application possibilities. Among the main challenges, however, is the issue of service integration for the application development in such heterogeneous environments. Service integration has been considered by major middleware as a user centric approach as it responds to user requests and needs. In this article, we propose a novel way to integrate services considering only their availability, the functionalities they propose and their non functional QoS properties rather than the users direct requests. We define MySIM, a spontaneous service integration middleware. MySIM integrates services spontaneously on an event based mechanism and transparently for users and applications, extending by that the environment with functionalities. We developed a prototype as a proof of concept and evaluated its efficiency over a real use …"
  },
     {
    "name": "Rpl: The routing standard for the internet of things... or is it?",
    "author": ["OIO"],
    "abstract": "RPL, the IPv6 Routing Protocol for low-power and lossy networks, is considered the de facto routing protocol for the Internet of Things (IoT). Since its standardization, RPL has contributed to the advancement of communications in the world of tiny, embedded networking devices by providing, along with other standards, a baseline architecture for IoT. Several years later, we analyze the extent to which RPL has lived up to the expectations defined by the IETF requirements, and tie our analysis to current trends, identifying the challenges RPL must face to remain on the forefront of IoT technology."
  },
     {
    "name": "Using multiparent routing in RPL to increase the stability and the lifetime of the network",
    "author": ["OIO"],
    "abstract": "Energy is a very scarce resource in Wireless Sensor Networks. While most of the current proposals focus on minimizing the global energy consumption, we aim here at designing an energy-balancing routing protocol that maximizes the lifetime of the most constraint nodes. To improve the network lifetime, each node should consume the same (minimal) quantity of energy. We propose the Expected Lifetime metric, denoting the residual time of a node (time until the node will run out of energy). We design mechanisms to detect energy-bottleneck nodes and to spread the traffic load uniformly among them. Moreover, we apply this metric to RPL, the de facto routing standard in low-power and lossy networks. In order to avoid instabilities in the network and problems of convergence, we propose here a multipath approach. We exploit the Directed Acyclic Graph (DAG) structure of the routing topology to probabilistically …"
  },
     {
    "name": "LoRa from the city to the mountains: Exploration of hardware and environmental factors",
    "author": ["OIO"],
    "abstract": "LoRa technology is an increasingly popular option for applications that can exploit its low power and long range capabilities. While most efforts to date have studied its characteristics for smart city environments, we take LoRa outside the city limits, exploring how the environment affects its core communication properties. Specifically, we offer two novel parameter explorations to understand first how vegetation affects communication range and second how antennas change radio behavior. Our results provide insight into LoRa in non-urban environments, specifically sWe propose an application of multi-label “Graph Cut” optimization algorithms to the simultaneous segmentation of multiple anatomical structures, initialized via an over-segmentation of the image computed by a fast centroidal Voronoi diagram (CVD) clustering algorithm. With respect to comparable segmentations computed directly on the voxels of image volumes, we demonstrate performance improvements on both execution speed and memory footprint by, at least, an order of magnitude, making it possible to process large volumes on commodity hardware which could not be processed pixel-wise.howing that vegetation dramatically reduces the communication range and that the antenna selection can have a profound effect"
  },
     {
    "name": "Stability and efficiency of RPL under realistic conditions in wireless sensor networks",
    "author": ["OIO"],
    "abstract": "The IPv6 Routing Protocol for Low-Power and Lossy Networks (RPL) is one of the emerging routing standards for multihop Wireless Sensor Networks (WSN). RPL is based on the construction of a Destination-Oriented Directed Acyclic Graph (DODAG), which offers a loop-free topology to route data packets. While several routing metrics have been proposed in the literature, it is unclear how they perform with RPL. In this paper, we analyze the impact of different PHY and MAC metrics on the stability and efficiency of RPL. We highlight the fact that realistic conditions lead to instabilities and oscillations in the routing structure. While minimizing the hop length leads to a stable but poor routing structure, more sophisticated link metrics such as ETX reflect more clearly the radio link quality but increase the number of DODAG reconfigurations. We also provided a detailed methodology to measure the DODAG stability and to …"
  },
     {
    "name": "Improving the network lifetime with energy-balancing routing: Application to RPL",
    "author": ["OIO"],
    "abstract": "The devices composing Wireless Sensor Networks (WSN) are very limited in terms of memory, processing power and battery. We need efficient routing algorithms to ensure a long lifetime of the WSN. However, many solutions focus on minimizing the average energy consumption of all the nodes. Since the lifetime is rather given by the death of the first node or by the disconnection of the network, these solutions are currently insufficient. Here, we have rather chosen to focus on identifying the energy bottlenecks (i.e., the nodes that are more likely to be the first ones to run out of energy). Minimizing their energy consumption will surely improve the network lifetime. We define here the Expected LifeTime (ELT) routing metric to estimate the lifetime of these bottlenecks. We take into account both the amount of traffic and the link reliability to estimate how much energy such a bottleneck consumes on average. Moreover, we …"
  },
     {
    "name": "Exploiting multiple parents in RPL to improve both the network lifetime and its stability",
    "author": ["OIO"],
    "abstract": "The devices composing Wireless Sensor Networks (WSN) are very limited in terms of memory, processing power and battery. RPL has emerged as the de facto routing standard in low-power and lossy networks. While most of the proposals focus on minimizing the global energy consumption, we aim here at designing an energy-balancing routing protocol: each node should efficiently consume the same quantity of energy to improve the network lifetime. To this end, we exploit an Expected Lifetime metric, denoting the residual time of the nodes (time until the node will run out of energy). We propose mechanisms to detect the energy-bottleneck nodes and to spread the traffic load uniformly among them. While RPL constructs a Destination-Oriented Directed Acyclic Graph (DODAG) structure, it only implements single path. We propose here to exploit its natural multipath structure. This multipath approach helps reducing …"
  },
     {
    "name": "A web interface for 3D visualization and interactive segmentation of medical images",
    "author": ["RKE"],
    "abstract": "We propose a web-accessible image visualization and processing framework well-suited for medical applications. Exploiting client-side HTML5 and WebGL technologies, our proposal allows the end-user to efficiently browse and visualize volumic images in an Out-Of-Core (OOC) manner, annotate and apply server-side image processing algorithms and interactively visualize 3D medical models. Server-side implementation is driven by a file-based, simple, robust and flexible Remote Procedure Call (RPC) scheme well suited for heterogeneous applications. We demonstrate the efficiency of our approach with both an interactive medical image segmentation and a 3D rendering of segmented anatomical structures. As a secondary contribution, we improve the segmentation algorithm with the introduction of user-defined anatomical priors."
  },
     {
    "name": "Shortest-path constraints for 3d multiobject semiautomatic segmentation via clustering and graph cut",
    "author": ["RKE"],
    "abstract": "We derive shortest-path constraints from graph models of structure adjacency relations and introduce them in a joint centroidal Voronoi image clustering and Graph Cut multiobject semiautomatic segmentation framework. The vicinity prior model thus defined is a piecewise-constant model incurring multiple levels of penalization capturing the spatial configuration of structures in multiobject segmentation. Qualitative and quantitative analyses and comparison with a Potts prior-based approach and our previous contribution on synthetic, simulated, and real medical images show that the vicinity prior allows for the correct segmentation of distinct structures having identical intensity profiles and improves the precision of segmentation boundary placement while being fairly robust to clustering resolution. The clustering approach we take to simplify images prior to segmentation strikes a good balance between boundary …"
  },
     {
    "name": "Automatic 3D multiorgan segmentation via clustering and graph cut using spatial relations and hierarchically-registered atlases",
    "author": ["RKE"],
    "abstract": "We propose a generic method for automatic multiple-organ segmentation based on a multilabel Graph Cut optimization approach which uses location likelihood of organs and prior information of spatial relationships between them. The latter is derived from shortest-path constraints defined on the adjacency graph of structures and the former is defined by probabilistic atlases learned from a training dataset. Organ atlases are mapped to the image by a fast (2+1)D hierarchical registration method based on SURF keypoints. Registered atlases are furthermore used to derive organ intensity likelihoods. Prior and likelihood models are then introduced in a joint centroidal Voronoi image clustering and Graph Cut multiobject segmentation framework. Qualitative and quantitative evaluation has been performed on contrast-enhanced CT images from the Visceral Benchmark dataset."
  },
     {
    "name": "Automatic multiorgan segmentation via multiscale registration and graph cut",
    "author": ["RKE"],
    "abstract": "We propose an automatic multiorgan segmentation method for 3-D radiological images of different anatomical contents and modalities. The approach is based on a simultaneous multilabel graph cut optimization of location, appearance, and spatial configuration criteria of target structures. Organ location is defined by target-specific probabilistic atlases (PA) constructed from a training dataset using a fast (2+1)D SURF-based multiscale registration method involving a simple four-parameter transformation. PAs are also used to derive target-specific organ appearance models represented as intensity histograms. The spatial configuration prior is derived from shortest-path constraints defined on the adjacency graph of structures. Thorough evaluations on Visceral project benchmarks and training dataset, as well as comparisons with the state-of-the-art confirm that our approach is comparable to and often outperforms …"
  },
     {
    "name": "Efficient multi-object segmentation of 3D medical images using clustering and graph cuts",
    "author": ["RKE"],
    "abstract": "We propose an application of multi-label “Graph Cut” optimization algorithms to the simultaneous segmentation of multiple anatomical structures, initialized via an over-segmentation of the image computed by a fast centroidal Voronoi diagram (CVD) clustering algorithm. With respect to comparable segmentations computed directly on the voxels of image volumes, we demonstrate performance improvements on both execution speed and memory footprint by, at least, an order of magnitude, making it possible to process large volumes on commodity hardware which could not be processed pixel-wise."
  },
     {
    "name": "Faust-STK: a set of linear and nonlinear physical models for the Faust programming language",
    "author": ["RMI"],
    "abstract": "The FAUST Synthesis ToolKit is a set of virtual musical instruments written in the FAUST programming language and based on waveguide algorithms and on modal synthesis. Most of them were inspired by instruments implemented in the Synthesis ToolKit and the program SynthBuilder."
  },
     {
    "name": "Mobile music, sensors, physical modeling, and digital fabrication: Articulating the augmented mobile instrument",
    "author": ["RMI"],
    "abstract": "Two concepts are presented, extended, and unified in this paper: mobile device augmentation towards musical instruments design and the concept of hybrid instruments. The first consists of using mobile devices at the heart of novel musical instruments. Smartphones and tablets are augmented with passive and active elements that can take part in the production of sound (e.g., resonators, exciter, etc.), add new affordances to the device, or change its global aesthetics and shape. Hybrid instruments combine physical/acoustical and “physically informed” virtual/digital elements. Recent progress in physical modeling of musical instruments and digital fabrication is exploited to treat instrument parts in a multidimensional way, allowing any physical element to be substituted with a virtual one and vice versa (as long as it is physically possible). A wide range of tools to design mobile hybrid instruments is introduced and evaluated. Aesthetic and design considerations when making such instruments are also presented through a series of examples."
  },
     {
    "name": "Towards an fpga-based compilation flow for ultra-low latency audio signal processing",
    "author": ["RMI"],
    "abstract": "Field Programmable Gate Arrays (FPGAs) have been increasingly used in recent years for real-time audio Digital Signal Processing (DSP) applications. They provide unparalleled audio latency and processing power performances. They can target extremely high audio sampling rates and their large number of General Purpose Inputs and Outputs (GPIOs) make them particularly adapted to the development of large scale systems with an extended number of analog audio inputs and outputs. On the other hand, programming them is extremely complex and out of reach to non-specialized engineers as well as to most people in the audio community. In this paper, we introduce a comprehensive FPGA-based environment for real-time audio DSP programmable at a high level with the FAUST programming language. Our system reaches unequaled latency performances (11 µs round-trip) and can be easily controlled using both a software graphical user interface and a dedicated hardware controller taking the form of a sister board for our FPGA board. The implementation of the system is described in details and its performances are evaluated. Directions for future work and potential applications are presented as well."
  },
     {
    "name": "Real time audio digital signal processing with Faust and the Teensy",
    "author": ["RMI"],
    "abstract": "This paper introduces a series of tools to program the Teensy development board series with the FAUST programming language. faust2teensy is a command line application that can be used both to generate new objects for the Teensy Audio Library and standalone Teensy programs. We also demonstrate how faust2api can produce Digital Signal Processing engines (with potential polyphony support) for the Teensy. Details about the implementation and optimizations of these systems are provided and the results of various tests (ie, computational, latency, etc.) are presented. Finally, future directions for this work are discussed through a discussion on bare-metal implementation of real-time audio signal processing applications."
  },
     {
    "name": "A faust architecture for the ESP32 microcontroller",
    "author": ["RMI"],
    "abstract": "This paper introduces faust2esp32, a tool to generate digital signal processing engines for the ESP32 microcontroller family. It can target both the C++ and the Arduino ESP32 programming environment and it supports a wide range of audio codecs, making it compatible with most ESP32-based prototyping boards. After demonstrating how to use faust2esp32 and providing technical details about its implementation, we evaluate its performances and we present the FAUST Gramophone which is a programmable instrument taking advantage of this technology. Finally, future plans around embedded systems for real-time audio processing and FAUST are presented."
  },
     {
    "name": "Augmenting the iPad: the BladeAxe",
    "author": ["RMI"],
    "abstract": "In this paper, we present the BladeAxe: an iPad-based musical instrument leveraging the concepts of “augmented mobile device” and “hybrid physical model controller.” By being almost fully standalone, it can be used easily on stage in the frame of a live performance by simply plugging it to a traditional guitar amplifier or to any sound system. Its acoustical plucking system provides the performer with an extended expressive potential compared to a standard controller."
  },
     {
    "name": "A Microcontroller-Based Network Client Towards Distributed Spatial Audio",
    "author": ["TRU", "RMI"],
    "abstract": "Audio spatialisation techniques such as wave field synthesis call for the deployment of large arrays of loudspeakers, typically managed by dedicated audio hardware. Such systems are typically costly, inflexible, and limited by the computational demands and high throughput requirements of centralised, highly-multichannel digital signal processing. The development of a distributed system for audio spatialisation based on Audio over Ethernet represents a potential easing of the infrastructural burdens posed by traditional, centralised approaches. This work details the development of a networked audio client, supporting the popular JackTrip audio protocol, and running on a low-cost microcontroller. The system is applied to the case of a wave field synthesis installation, with a number of client instances forming a distributed array of signal processors. The problems of client-server latency, and interclient synchronicity are discussed and a mitigative strategy described. The client software and hardware modules could support large scale audio installations, plus serve as self-contained interfaces for other networked audio applications."
  },
     {
    "name": "A Real-time Embodied Sonification Model to Convey Temporal Asymmetry During Running",
    "author": ["TRU"],
    "abstract": "Existing research has shown that auditory biofeedback can be a powerful tool in improving athletic performance, exploiting the otherwise under-used auditory channel to convey relevant kinematic information. To date, however, no such research has focused on running gait asymmetry, which has a proven link to running economy (energy expenditure). In this work, we designed and developed an intuitive sonification scheme for conveying temporal asymmetry to a runner. It specifically conveys short-and mediumterm information on ground contact time asymmetry and cadence through a set of embodied metaphors. We first developed and validated a lightweight algorithm for detecting running gait events, cadence, and ground contact time balance based on data from a single inertial sensor. These features were used as control parameters to a complex FM synthesis engine. The gait detection and sonification systems were implemented in a proof-of-concept application allowing real-time manipulation of system parameters to facilitate the user-centred design of a feasible and usable sonification topology. We hope that the application can form the basis for the development and evaluation of a wearable system for providing gait asymmetry biofeedback to runners in real time."
  },
     {
    "name": "Differentiable DSP in Faust",
    "author": ["TRU"],
    "abstract": "Differentiable Digital Signal Processing is the application of differentiable programming, whereby a computer program may be differentiated end-to-end, to audio tasks. Coupled with gradientbased optimisation methods, differentiable signal processors are central to a variety of audio problems and can be incorporated into machine learning architectures. In this paper it is shown that, using the environment expression and pattern matching abstraction, it is possible to write FAUST code that is differentiable end-to-end. A system for writing FAUST programs that are automatically differentiable in the forward-mode is developed and a parameter optimisation example presented. Differentiable programming in FAUST could serve as a platform for native approaches to machine learning problems in the audio domain."
  },
     {
    "name": "Networked microcontrollers for accessible, distributed spatial audio",
    "author": ["TRU","RMI"],
    "abstract": "State-of-the-art systems for spatial and immersive audio are typically very costly, being reliant on specialist audio hardware capable of performing computationally intensive signal processing and delivering output to many tens, if not hundreds, of loudspeakers. Centralised systems of this sort suffer from limited accessibility due to their inflexibility and expense. Building on the research of the past few decades in the transmission of audio data over computer networks, and the emergence in recent years of increasingly capable, low-cost microcontroller-based development platforms with support for both networking and audio functionality, we present a prototype decentralised, modular alternative. Having previously explored the feasibility of running a microcontroller device as a networked audio client, here we describe the development of a client-server system with improved scalability via multicast data transmission. The system operates on ubiquitous, commonplace computing and networking equipment, with a view to it being a simple, versatile, and highly-accessible platform, capable of granting users the freedom to explore audio spatialisation approaches at vastly reduced expense. Though faced by significant technical challenges, particularly with regard to maintaining synchronicity between distributed audio processors, the system produces perceptually plausible results. Findings are commensurate with a capability, with further development and research, to disrupt and democratise the fields of spatial and immersive audio."
  },
     {
    "name": "Segmentation of ultrasound images––multiresolution 2D and 3D algorithm based on global and local statistics",
    "author": ["ATI"],
    "abstract": "In this paper, we propose a robust adaptive region segmentation algorithm for noisy images, within a Bayesian framework. A multiresolution implementation of the algorithm is performed using a wavelets basis and can be used to process both 2D and 3D data. In this work we focus on the adaptive character of the algorithm and we discuss how global and local statistics can be utilised in the segmentation process. We propose an improvement on the adaptivity by introducing an enhancement to control the adaptive properties of the segmentation process. This takes the form of a weighting function accounting for both local and global statistics, and is introduced in the minimisation. A new formulation of the segmentation problem allows us to control the effective contribution of each statistical component. The segmentation algorithm is demonstrated on synthetic data, 2D breast ultrasound data and on echocardiographic …"
  },
     {
    "name": "Multiresolution texture based adaptive clustering algorithm for breast lesion segmentation",
    "author": ["ATI"],
    "abstract": "A specific algorithm is presented for the automatic extraction of breast tumors in ultrasonic imaging. Method: The algorithm involves two-dimensional adaptive K-means clustering of the gray scale and textural feature images. The segmentation problem is formulated as a maximum a posteriori (MAP) estimation problem. The MAP estimation is achieved using Besag's iterated conditional modes algorithm for the minimization of an energy function. This function has three components: the first constrains the region to be close to the data; the second imposes spatial continuity; and the third takes into consideration the texture of the various regions. A multiresolution implementation of the algorithm is performed using a wavelets basis. Results: Experiments were carried out on synthetic images and on in vivo breast ultrasound images. Various parameters involved in the algorithm are discussed to evaluate the robustness and accuracy of the segmentation method. Conclusion: Including textural features in the segmentation of ultrasonic data improves the robustness of the algorithm and makes the segmentation result less parameter dependent."
  },
     {
    "name": "A multiparametric and multiresolution segmentation algorithm of 3D ultrasonic data",
    "author": ["ATI"],
    "abstract": "An algorithm devoted to the segmentation of 3-D ultrasonic data is proposed. The algorithm involves 3-D adaptive clustering based on multiparametric information: the gray-scale intensity of the echographic data, 3-D texture features calculated from the envelope data, and 3-D tissue characterization information calculated from the local frequency spectra of the radio-frequency signals. The segmentation problem is formulated as a maximum a posterior (MAP) estimation problem. A multi-resolution implementation of the algorithm is proposed. The approach is tested on simulated data and on in vivo echocardiographic 3-D data. The results presented in the paper illustrate the robustness and the accuracy of the proposed approach for the segmentation of ultrasonic data."
  }
,
     {
    "name": "Simulation of vehicular ad-hoc networks: Challenges, review of tools and recommendations",
    "author": ["RST"],
    "abstract": "Vehicular communications are considered the next step in increasing transportation safety and comfort. The prohibitive price of operational test beds means that computer simulations are the only viable solution for analysing the performance of different protocols and architectures. However, simulation frameworks used in vehicular ad-hoc networks research are still highly heterogeneous and, as a consequence, many of the proposed ideas can not be compared and validated. In this paper, we focus on the challenges faced when modelling the vehicular environment and the solutions adopted in the main simulation tools. As the research community is concerned with many different problems, from safety related issues to traffic efficiency and from intersection management to Internet access, we consider that every study should chose the appropriate simulator based on its requirements. Consequently, we make some …"
  }
,
     {
    "name": "Classifying call profiles in large-scale mobile traffic datasets",
    "author": ["RST"],
    "abstract": "Cellular communications are undergoing significant evolutions in order to accommodate the load generated by increasingly pervasive smart mobile devices. Dynamic access network adaptation to customers' demands is one of the most promising paths taken by network operators. To that end, one must be able to process large amount of mobile traffic data and outline the network utilization in an automated manner. In this paper, we propose a framework to analyze broad sets of Call Detail Records (CDRs) so as to define categories of mobile call profiles and classify network usages accordingly. We evaluate our framework on a CDR dataset including more than 300 million calls recorded in an urban area over 5 months. We show how our approach allows to classify similar network usage profiles and to tell apart normal and outlying call behaviors."
  }
,
     {
    "name": "Offloading Floating Car Data",
    "author": ["RST"],
    "abstract": "Floating Car Data (FCD) is currently collected by moving vehicles and uploaded to Internet-based processing centers through the cellular access infrastructure. As FCD is foreseen to rapidly become a pervasive technology, the present network paradigm risks not to scale well in the future, when a vast majority of automobiles will be constantly sensing their operation as well as the external environment and transmitting such information towards the Internet. In order to relieve the cellular network from the additional load that widespread FCD can induce, we study a local gathering and fusion paradigm, based on vehicle-to-vehicle (V2V) communication. We show how this approach can lead to significant gain, especially when and where the cellular network is stressed the most. Moreover, we propose several distributed schemes to FCD offloading based on the principle above that, despite their simplicity, are extremely …"
  }
]
